app/controllers/admin/lessons_controller.rb

SELECT "lessons".* FROM "lessons" WHERE "lessons"."slug" = $1 LIMIT $2  [["slug", "welcome"], ["LIMIT", 1]]
---
  def edit
    @lesson = Lesson.find_by!(slug: params[:id])