source/app/controllers/admin/dashboard_controller.rb

  def index
    @users_count      = User.count
    @completed_count  = User.where.not(pathway_completed_at: nil).count
    @scheduled_count  = Appointment.where(status: "scheduled").count
    @recent_users     = User.order(created_at: :desc).limit(10)
---
SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "users" WHERE "users"."pathway_completed_at" IS NOT NULL
SELECT COUNT(*) FROM "appointments" WHERE "appointments"."status" = $1  [["status", "scheduled"]]
SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC LIMIT $1  [["LIMIT", 10]]