source/app/controllers/lessons_controller.rb

SELECT "lessons".* FROM "lessons" WHERE "lessons"."published" = $1 AND "lessons"."slug" = $2 LIMIT $3  [["published", true], ["slug", "welcome"], ["LIMIT", 1]]
---
  def set_lesson
    @lesson = Lesson.published.find_by!(slug: params[:id])